In [1]:
import pandas as pd
import numpy as np
import os 
import datetime

In [2]:
file1 = "Resources/Boston_calendar1.xlsx"
boston_df1 = pd.read_excel(file1)
boston_df1.head()

   listing_id       date available  price
0    12147973 2017-09-05         f    NaN
1    12147973 2017-09-04         f    NaN
2    12147973 2017-09-03         f    NaN
3    12147973 2017-09-02         f    NaN
4    12147973 2017-09-01         f    NaN

In [3]:
boston_df1 = boston_df1.dropna(how="any")
boston_df1.count()

listing_id    257677
date          257677
available     257677
price         257677
dtype: int64

In [4]:
file2 = "Resources/Boston_calendar2.xlsx"
boston_df2 = pd.read_excel(file2)
boston_df2.head()

   listing_id       date available  price
0      693353 2016-11-02         t  240.0
1      693353 2016-11-01         t  240.0
2      693353 2016-10-31         t  352.0
3      693353 2016-10-30         t  352.0
4      693353 2016-10-29         t  389.0

In [5]:
boston_df2 = boston_df1.dropna(how="any")
boston_df2.count()

listing_id    257677
date          257677
available     257677
price         257677
dtype: int64

In [6]:
df_final_boston = pd.concat([boston_df1, boston_df2])

df_final_boston.count()

listing_id    515354
date          515354
available     515354
price         515354
dtype: int64

In [7]:
df_final_boston.head()

     listing_id       date available  price
365     3075044 2017-08-22         t   65.0
366     3075044 2017-08-21         t   65.0
367     3075044 2017-08-20         t   65.0
368     3075044 2017-08-19         t   75.0
369     3075044 2017-08-18         t   75.0

In [11]:
df_final_boston['year'] = df_final_boston['date'].dt.year
df_final_boston.head()

     listing_id       date available  price  year
365     3075044 2017-08-22         t   65.0  2017
366     3075044 2017-08-21         t   65.0  2017
367     3075044 2017-08-20         t   65.0  2017
368     3075044 2017-08-19         t   75.0  2017
369     3075044 2017-08-18         t   75.0  2017

In [33]:
df_final_boston['Location'] = 'Boston'
df_final_boston.head()

     listing_id       date available  price  year Location  Month
365     3075044 2017-08-22         t   65.0  2017   Boston      8
366     3075044 2017-08-21         t   65.0  2017   Boston      8
367     3075044 2017-08-20         t   65.0  2017   Boston      8
368     3075044 2017-08-19         t   75.0  2017   Boston      8
369     3075044 2017-08-18         t   75.0  2017   Boston      8

In [34]:
# df_final_boston['Month'] = df_final_boston['date'].dt.month
df_final_boston.count()

listing_id    515354
date          515354
available     515354
price         515354
year          515354
Location      515354
Month         515354
dtype: int64

In [50]:
Yearly = df_final_boston.groupby('year')
avgPrice = df_final_boston['price'].mean()

yearly_df = pd.DataFrame({'Year': Yearly,
                         'Average Price': avgPrice})
yearly_df

ValueError: If using all scalar values, you must pass an index